/*
	File:		SlicesStrings.strings

	Contains:
	Copyright:	© 2007-2009 by Apple Inc., all rights reserved.
*/

//===========================================================================
// NOTE FOR LOCALIZERS:
// For any attributes overridden using the MDSlicesAttributeNameOverrides
// strings file, special care must be taken here. The KEY of the strings
// here will change from its english version to the name override.  For example:
//
// If MDSlicesAttributeNameOverrides.strings contains:
//		kMDItemTextContent = "TEXTCONTENT";
//
// Then replace any use of "Contents" (the english localization) in the KEYS
// of this file with the localization provided in MDSlicesAttributeNameOverrides.strings.
//
// In the above example, the localizer should change the text content localization below from:
//		"%[Contents]@ contains %@" = "%1$[Contents]@ contains %2$@";  // english version
//	to:
//		"%[TEXTCONTENT]@ contains %@" = "%1$[TEXTCONTENT]@ xxxxxx %2$@"; // localized version
//===========================================================================

/* Compound-type slices */
"%[Any]@ of the following are true" = "%1$[Noe]@ av det følgende er sant";
"%[All]@ of the following are true" = "%1$[Alt]@ av det følgende er sant";
"%[None]@ of the following are true" = "%1$[Ikke noe]@ av det følgende er sant";

/* Specific kind strings */
"%[Kind]@ is %[any]@" = "%1$[Type]@ er %2$[Hvilken som helst]@";
"%[Kind]@ is %[applications]@" = "%1$[Type]@ er %2$[program]@";
"%[Kind]@ is %[documents]@" = "%1$[Type]@ er %2$[dokument]@";
"%[Kind]@ is %[folders]@" = "%1$[Type]@ er %2$[mappe]@";
"%[Kind]@ is %[images]@ %[all]@" = "%1$[Type]@ er %2$[bilde]@ %3$[alle]@";
"%[Kind]@ is %[images]@ %[JPEG]@" = "%1$[Type]@ er %2$[bilde]@ %3$[JPEG]@";
"%[Kind]@ is %[images]@ %[TIFF]@" = "%1$[Type]@ er %2$[bilde]@ %3$[TIFF]@";
"%[Kind]@ is %[images]@ %[GIF]@" = "%1$[Type]@ er %2$[bilde]@ %3$[GIF]@";
"%[Kind]@ is %[images]@ %[PNG]@" = "%1$[Type]@ er %2$[bilde]@ %3$[PNG]@";
"%[Kind]@ is %[images]@ %[BMP]@" = "%1$[Type]@ er %2$[bilde]@ %3$[BMP]@";
"%[Kind]@ is %[music]@ %[all]@" = "%1$[Type]@ er %2$[Musikk]@ %3$[Alle]@";
"%[Kind]@ is %[music]@ %[MP3]@" = "%1$[Type]@ er %2$[Musikk]@ %3$[MP3]@";
"%[Kind]@ is %[music]@ %[AAC]@" = "%1$[Type]@ er %2$[Musikk]@ %3$[AAC]@";
"%[Kind]@ is %[music]@ %[purchased]@" = "%1$[Type]@ er %2$[Musikk]@ %3$[Kjøpt]@";
"%[Kind]@ is %[PDF]@" = "%1$[Type]@ er %2$[PDF]@";
"%[Kind]@ is %[presentations]@" = "%1$[Type]@ er %2$[presentasjon]@";
"%[Kind]@ is %[text]@ %[all]@" = "%1$[Type]@ er %2$[Tekst]@ %3$[Alle]@";
"%[Kind]@ is %[text]@ %[plain text]@" = "%1$[Type]@ er %2$[Tekst]@ %3$[Ren tekst]@";
"%[Kind]@ is %[text]@ %[rich text]@" = "%1$[Type]@ er %2$[Tekst]@ %3$[Rik tekst]@";
"%[Kind]@ is %[text]@ %[HTML]@" = "%1$[Type]@ er %2$[Tekst]@ %3$[HTML]@";
"%[Kind]@ is %[text]@ %[XML]@" = "%1$[Type]@ er %2$[Tekst]@ %3$[XML]@";
"%[Kind]@ is %[text]@ %[source code]@" = "%1$[Type]@ er %2$[Tekst]@ %3$[Kildekode]@";
"%[Kind]@ is %[movies]@" = "%1$[Type]@ er %2$[film]@";
"%[Kind]@ is %[other]@ %@" = "%1$[Type]@ er %2$[Annen]@ %3$@";

/* date-type attribute template, like kMDItemContentCreationDate */
"%@ is %[within last]@ %@ %[days]@" = "%1$@ er %2$[i løpet av de siste]@ %3$@ %4$[dagene]@";
"%@ is %[within last]@ %@ %[weeks]@" = "%1$@ er %2$[i løpet av de siste]@ %3$@ %4$[ukene]@";
"%@ is %[within last]@ %@ %[months]@" = "%1$@ er %2$[i løpet av de siste]@ %3$@ %4$[månedene]@";
"%@ is %[within last]@ %@ %[years]@" = "%1$@ er %2$[i løpet av de siste]@ %3$@ %4$[årene]@";
"%@ is %[exactly]@ %@" = "%1$@ er %2$[nøyaktig]@ %3$@";
"%@ is %[before]@ %@" = "%1$@ er %2$[før]@ %3$@";
"%@ is %[after]@ %@" = "%1$@ er %2$[etter]@ %3$@";
"%@ is %[today]@" = "%1$@ er %2$[i dag]@";
"%@ is %[yesterday]@" = "%1$@ er %2$[i går]@";
"%@ is %[this week]@" = "%1$@ er %2$[denne uken]@";
"%@ is %[this month]@" = "%1$@ er %2$[denne måneden]@";
"%@ is %[this year]@" = "%1$@ er %2$[dette året]@";

/* string-type attribute, like kMDItemDisplayName */
"%@ %[contains]@ %@" = "%1$@ %2$[inneholder]@ %3$@";
"%@ %[begins with]@ %@" = "%1$@ %2$[begynner med]@ %3$@";
"%@ %[ends with]@ %@" = "%1$@ %2$[slutter med]@ %3$@";
"%@ %[is]@ %@" = "%1$@ %2$[er]@ %3$@";
"%@ %[matches]@ %@" = "%1$@ %2$[er lik]@ %3$@";

/* boolean-type attribute, like kMDItemFlashOnOff */
"%@ %[any]@" = "%1$@ %2$[Alle]@";
"%@ %[yes]@" = "%1$@ %2$[Ja]@";
"%@ %[no]@" = "%1$@ %2$[Nei]@";

/* file visibility */
"%[File invisible]@ %[visible items]@" = "%1$[Synlighet for filen]@ %2$[Synlige objekter]@";
"%[File invisible]@ %[invisible items]@" = "%1$[Synlighet for filen]@ %2$[Usynlige objekter]@";
"%[File invisible]@ %[visible or invisible]@" = "%1$[Synlighet for filen]@ %2$[Synlige eller usynlige]@";

/* raw query slice */
"%[Raw query]@ %@" = "%1$[Rent søk]@ %2$@";

/* file extension slice */
"%[File Extension]@ %[is]@ %@" = "%1$[Filendelse]@ %2$[er]@ %3$@";

/* number-type attribute, like kMDItemAudioChannelCount */
"%@ %[equals]@ %@" = "%1$@ %2$[er lik]@ %3$@";
"%@ %[is greater than]@ %@" = "%1$@ %2$[er større enn]@ %3$@";
"%@ %[is less than]@ %@" = "%1$@ %2$[er mindre enn]@ %3$@";
"%@ %[is not]@ %@" = "%1$@ %2$[er ikke]@ %3$@";

/* text contents */
"%@ contains %@" = "%1$@ inneholder %2$@";

/* Byte-sized attributes, such as kMDItemFSSize */
"%@ %[equals]@ %@ %[KB]@" = "%1$@ %2$[er lik]@ %3$@ %4$[kB]@";
"%@ %[equals]@ %@ %[MB]@" = "%1$@ %2$[er lik]@ %3$@ %4$[MB]@";
"%@ %[equals]@ %@ %[GB]@" = "%1$@ %2$[er lik]@ %3$@ %4$[GB]@";
"%@ %[is less than]@ %@ %[KB]@" = "%1$@ %2$[er mindre enn]@ %3$@ %4$[kB]@";
"%@ %[is less than]@ %@ %[MB]@" = "%1$@ %2$[er mindre enn]@ %3$@ %4$[MB]@";
"%@ %[is less than]@ %@ %[GB]@" = "%1$@ %2$[er mindre enn]@ %3$@ %4$[GB]@";
"%@ %[is greater than]@ %@ %[KB]@" = "%1$@ %2$[er større enn]@ %3$@ %4$[kB]@";
"%@ %[is greater than]@ %@ %[MB]@" = "%1$@ %2$[er større enn]@ %3$@ %4$[MB]@";
"%@ %[is greater than]@ %@ %[GB]@" = "%1$@ %2$[er større enn]@ %3$@ %4$[GB]@";
"%@ %[is not]@ %@ %[KB]@" = "%1$@ %2$[er ikke]@ %3$@ %4$[kB]@";
"%@ %[is not]@ %@ %[MB]@" = "%1$@ %2$[er ikke]@ %3$@ %4$[MB]@";
"%@ %[is not]@ %@ %[GB]@" = "%1$@ %2$[er ikke]@ %3$@ %4$[GB]@";

/* Duration-type attributes, such as kMDItemDurationSeconds */
"%@ %[equals]@ %@ hours %@ minutes %@ seconds" = "%1$@ %2$[er lik]@ %3$@ timer %4$@ minutter %5$@ sekunder";
"%@ %[is less than]@ %@ hours %@ minutes %@ seconds" = "%1$@ %2$[er mindre enn]@ %3$@ timer %4$@ minutter %5$@ sekunder";
"%@ %[is greater than]@ %@ hours %@ minutes %@ seconds" = "%1$@ %2$[er større enn]@ %3$@ timer %4$@ minutter %5$@ sekunder";
"%@ %[is not]@ %@ hours %@ minutes %@ seconds" = "%1$@ %2$[er ikke]@ %3$@ timer %4$@ minutter %5$@ sekunder";

/* This is for the slice that is added when a search string is present in the search field when saving a search. */
"%[Items matching text]@ %@" = "%1$[Objekter som samsvarer med teksten]@ %2$@";

/* Search System Files slice */
"%[SEARCH_SYSTEM_FILES]@ %[YES]@" = "%1$[Systemfiler]@ %2$[er inkluderte]@";
"%[SEARCH_SYSTEM_FILES]@ %[NO]@" = "%1$[Systemfiler]@ %2$[er ikke inkluderte]@";

/* Spotlight items slice */
"%[SEARCH_SPOTLIGHT_ITEMS]@ %[YES]@" = "%1$[Spotlight-objekter]@ %2$[er inkluderte]@";
"%[SEARCH_SPOTLIGHT_ITEMS]@ %[NO]@" = "%1$[Spotlight-objekter]@ %2$[er ikke inkluderte]@";

